tiborsimon/embedded-tdd-headers/pic/pic18/pic18lf23k22_tdd.h
#define RD163                         1091
#define TMR3L                         1092
#define TMR3H                         1093
#define T3GCON                        1094
#define T3GSS0                        1095
#define T3GSS                         1096
#define T3GSS1                        1097
#define T3GVAL                        1098
#define T3GGO                         1099
#define T3GGO_NOT_DONE                1100
#define T3G_DONE                      1101
#define T3GGO_nDONE                   1102
#define T3GSPM                        1103
#define T3GTM                         1104
#define T3GPOL                        1105
#define TMR3GE                        1106
#define ECCP1AS                       1107
#define P1SSBD0                       1108
#define PSS1BD                        1109
#define P1SSBD                        1110
#define PSSBD                         1111
#define PSSBD0                        1112
#define PSS1BD0                       1113
#define P1SSBD1                       1114
#define PSSBD1                        1115
#define PSS1BD1                       1116
#define P1SSAC0                       1117
#define PSSAC                         1118
#define PSS1AC                        1119
#define PSSAC0                        1120
#define PSS1AC0                       1121
#define P1SSAC                        1122
#define P1SSAC1                       1123
#define PSSAC1                        1124
#define PSS1AC1                       1125
#define CCP1AS0                       1126
#define CCP1AS                        1127
#define ECCPAS                        1128
#define ECCPAS0                       1129
#define CCP1AS1                       1130
#define ECCPAS1                       1131
#define CCP1AS2                       1132
#define ECCPAS2                       1133
#define ECCPASE                       1134
#define CCP1ASE                       1135
#define PWM1CON                       1136
#define PDC0                          1137
#define P1DC                          1138
#define P1DC0                         1139
#define PDC                           1140
#define PDC1                          1141
#define P1DC1                         1142
#define PDC2                          1143
#define P1DC2                         1144
#define PDC3                          1145
#define P1DC3                         1146
#define PDC4                          1147
#define P1DC4                         1148
#define PDC5                          1149
#define P1DC5                         1150
#define P1DC6                         1151
#define PDC6                          1152
#define PRSEN                         1153
#define P1RSEN                        1154
#define BAUDCON1                      1155
#define BAUDCON1_ABDEN                1156
#define ABDEN1                        1157
#define BAUDCON1_WUE                  1158
#define WUE1                          1159
#define W4E                           1160
#define BRG161                        1161
#define BAUDCON1_BRG16                1162
#define BAUDCON1_CKTXP                1163
#define SCKP1                         1164
#define TXCKP                         1165
#define BAUDCON1_SCKP                 1166
#define TXCKP1                        1167
#define DTRXP1                        1168
#define RXDTP1                        1169
#define RXCKP                         1170
#define BAUDCON1_DTRXP                1171
#define RXDTP                         1172
#define RCMT1                         1173
#define RCIDL1                        1174
#define BAUDCON1_RCIDL                1175
#define RCMT                          1176
#define ABDOVF1                       1177
#define BAUDCON1_ABDOVF               1178
#define PSTR1CON                      1179
#define STR1A                         1180
#define STRA                          1181
#define STR1B                         1182
#define STRB                          1183
#define STR1C                         1184
#define STRC                          1185
#define STR1D                         1186
#define STRD                          1187
#define STR1SYNC                      1188
#define STRSYNC                       1189
#define T2CON                         1190
#define T2CKPS0                       1191
#define T2CKPS                        1192
#define T2CKPS1                       1193
#define TMR2ON                        1194
#define T2OUTPS0                      1195
#define T2OUTPS                       1196
#define T2OUTPS1                      1197
#define T2OUTPS2                      1198
#define T2OUTPS3                      1199
#define PR2                           1200
#define TMR2                          1201
#define CCP1CON                       1202
#define CCP1M0                        1203
#define CCP1M                         1204
#define CCP1M1                        1205
#define CCP1M2                        1206
#define CCP1M3                        1207
#define DC1B                          1208
#define DC1B0                         1209
#define DC1B1                         1210
#define P1M                           1211
#define P1M0                          1212
#define P1M1                          1213
#define CCPR1L                        1214
#define CCPR1H                        1215
#define ADCON2                        1216
#define ADCS0                         1217
#define ADCS                          1218
#define ADCS1                         1219
#define ADCS2                         1220
#define ACQT0                         1221
#define ACQT                          1222
#define ACQT1                         1223
#define ACQT2                         1224
#define ADFM                          1225
#define ADCON1                        1226
#define NVCFG                         1227
#define NVCFG0                        1228
#define NVCFG1                        1229
#define PVCFG                         1230
#define PVCFG0                        1231
#define CHSN3                         1232
#define PVCFG1                        1233
#define TRIGSEL                       1234
#define ADCON0                        1235
#define ADON                          1236
#define nDONE                         1237
#define GO_nDONE                      1238
#define NOT_DONE                      1239
#define GODONE                        1240
#define GO_DONE                       1241
#define DONE                          1242
#define GO_NOT_DONE                   1243
#define GO                            1244
#define CHS                           1245
#define CHS0                          1246
#define CHS1                          1247
#define CHS2                          1248
#define CHS3                          1249
#define CHS4                          1250
#define ADRESL                        1251
#define ADRESH                        1252
#define SSP1CON2                      1253
#define SEN1                          1254
#define SSP1CON2_SEN                  1255
#define ADMSK11                       1256
#define SSP1CON2_RSEN                 1257
#define RSEN1                         1258
#define ADMSK1                        1259
#define SSP1CON2_PEN                  1260
#define ADMSK21                       1261
#define PEN1                          1262
#define ADMSK2                        1263
#define ADMSK31                       1264
#define RCEN1                         1265
#define SSP1CON2_RCEN                 1266
#define ADMSK3                        1267
#define SSP1CON2_ACKEN                1268
#define ACKEN1                        1269
#define ADMSK41                       1270
#define ADMSK4                        1271
#define ACKDT1                        1272
#define ADMSK51                       1273
#define SSP1CON2_ACKDT                1274
#define ADMSK5                        1275
#define SSP1CON2_ACKSTAT              1276
#define ACKSTAT1                      1277
#define GCEN1                         1278
#define SSP1CON2_GCEN                 1279
#define SSP1CON1                      1280
#define SSP1CON1_SSPM0                1281
#define SSPM01                        1282
#define SSP1CON1_SSPM                 1283
#define SSP1CON1_SSPM1                1284
#define SSPM11                        1285
#define SSP1CON1_SSPM2                1286
#define SSPM21                        1287
#define SSPM31                        1288
#define SSP1CON1_SSPM3                1289
#define SSP1CON1_CKP                  1290
#define CKP1                          1291
#define SSPEN1                        1292
#define SSP1CON1_SSPEN                1293
#define SSPOV1                        1294
#define SSP1CON1_SSPOV                1295
#define WCOL1                         1296
#define SSP1CON1_WCOL                 1297
#define SSP1STAT                      1298
#define BF1                           1299
#define SSP1STAT_BF                   1300
#define UA1                           1301
#define SSP1STAT_UA                   1302
#define SSP1STAT_R_NOT_W              1303
#define READ_WRITE                    1304
#define RW1                           1305
#define NOT_W                         1306
#define SSP1STAT_W                    1307
#define I2C_READ                      1308
#define SSP1STAT_R                    1309
#define SSP1STAT_nW                   1310
#define RW                            1311
#define SSP1STAT_NOT_WRITE            1312
#define SSP1STAT_nWRITE               1313
#define SSP1STAT_R_W                  1314
#define SSP1STAT_R_nW                 1315
#define SSP1STAT_S                    1316
#define START                         1317
#define START1                        1318
#define I2C_START                     1319
#define STOP                          1320
#define SSP1STAT_P                    1321
#define STOP1                         1322
#define I2C_STOP                      1323
#define SSP1STAT_D                    1324
#define SSP1STAT_D_NOT_A              1325
#define NOT_A                         1326
#define SSP1STAT_D_A                  1327
#define SSP1STAT_D_nA                 1328
#define SSP1STAT_NOT_ADDRESS          1329
#define SSP1STAT_nA                   1330
#define SSP1STAT_A                    1331
#define DA1                           1332
#define DA                            1333
#define DATA_ADDRESS                  1334
#define SSP1STAT_nADDRESS             1335
#define I2C_DAT                       1336
#define SSP1STAT_CKE                  1337
#define CKE1                          1338
#define SSP1STAT_SMP                  1339
#define SMP1                          1340
#define SSP1ADD_SSPADD                1341
#define SSP1ADD_MSK0                  1342
#define MSK01                         1343
#define SSP1ADD                       1344
#define SSP1ADD_MSK1                  1345
#define MSK11                         1346
#define SSP1ADD_MSK2                  1347
#define MSK21                         1348
#define MSK31                         1349
#define SSP1ADD_MSK3                  1350
#define SSP1ADD_MSK4                  1351
#define MSK41                         1352
#define MSK51                         1353
#define SSP1ADD_MSK5                  1354
#define MSK61                         1355
#define SSP1ADD_MSK6                  1356
#define SSP1ADD_MSK7                  1357
#define MSK71                         1358
#define SSP1BUF_SSPBUF                1359
#define SSP1BUF                       1360
#define SSP1MSK                       1361
#define SSP1MSK_MSK0                  1362
#define SSP1MSK_MSK1                  1363
#define SSP1MSK_MSK2                  1364
#define SSP1MSK_MSK3                  1365
#define SSP1MSK_MSK4                  1366
#define SSP1MSK_MSK5                  1367
#define SSP1MSK_MSK6                  1368
#define SSP1MSK_MSK7                  1369
#define SSP1CON3                      1370
#define SSP1CON3_DHEN                 1371
#define SSP1CON3_AHEN                 1372
#define SSP1CON3_SBCDE                1373
#define SSP1CON3_SDAHT                1374
#define SSP1CON3_BOEN                 1375
#define SSP1CON3_SCIE                 1376
#define SSP1CON3_PCIE                 1377
#define SSP1CON3_ACKTIM               1378
#define T1GCON                        1379
#define T1GSS0                        1380
#define T1GSS                         1381
#define T1GSS1                        1382
#define T1GVAL                        1383
#define T1GGO_NOT_DONE                1384
#define T1GGO_nDONE                   1385
#define T1G_DONE                      1386
#define T1GGO                         1387
#define T1GSPM                        1388
#define T1GTM                         1389
#define T1GPOL                        1390
#define TMR1GE                        1391
#define T1CON                         1392
#define TMR1ON                        1393
#define RD16                          1394
#define T1RD16                        1395
#define NOT_T1SYNC                    1396
#define T1SYNC                        1397
#define nT1SYNC                       1398
#define T1SOSCEN                      1399
#define T1OSCEN                       1400
#define SOSCEN                        1401
#define T1CKPS0                       1402
#define T1CKPS                        1403
#define T1CKPS1                       1404
#define TMR1CS0                       1405
#define TMR1CS                        1406
#define TMR1CS1                       1407
#define TMR1L                         1408
#define TMR1H                         1409
#define RCON                          1410
#define BOR                           1411
#define NOT_BOR                       1412
#define nBOR                          1413
#define POR                           1414
#define nPOR                          1415
#define NOT_POR                       1416
#define PD                            1417
#define nPD                           1418
#define NOT_PD                        1419
#define NOT_TO                        1420
#define nTO                           1421
#define TO                            1422
#define nRI                           1423
#define NOT_RI                        1424
#define RI                            1425
#define SBOREN                        1426
#define IPEN                          1427
#define WDTCON                        1428
#define SWDTE                         1429
#define SWDTEN                        1430
#define OSCCON2                       1431
#define LFIOFS                        1432
#define MFIOFS                        1433
#define PRISD                         1434
#define SOSCGO                        1435
#define MFIOSEL                       1436
#define SOSCRUN                       1437
#define PLLRDY                        1438
#define OSCCON                        1439
#define SCS0                          1440
#define SCS                           1441
#define SCS1                          1442
#define IOFS                          1443
#define HFIOFS                        1444
#define OSTS                          1445
#define IRCF                          1446
#define IRCF0                         1447
#define IRCF1                         1448
#define IRCF2                         1449
#define IDLEN                         1450
#define T0CON                         1451
#define T0PS                          1452
#define T0PS0                         1453
#define T0PS1                         1454
#define T0PS2                         1455
#define PSA                           1456
#define T0SE                          1457
#define T0CS                          1458
#define T08BIT                        1459
#define TMR0ON                        1460
#define TMR0L                         1461
#define TMR0H                         1462
#define STATUS                        1463
#define C                             1464
#define CARRY                         1465
#define DC                            1466
#define ZERO                          1467
#define Z                             1468
#define OV                            1469
#define OVERFLOW                      1470
#define N                             1471
#define NEGATIVE                      1472
#define FSR2L                         1473
#define PLUSW2                        1474
#define PREINC2                       1475
#define POSTDEC2                      1476
#define POSTINC2                      1477
#define INDF2                         1478
#define FSR1L                         1479
#define PLUSW1                        1480
#define PREINC1                       1481
#define POSTDEC1                      1482
#define POSTINC1                      1483
#define INDF1                         1484
#define WREG                          1485
#define FSR0L                         1486
#define PLUSW0                        1487
#define PREINC0                       1488
#define POSTDEC0                      1489
#define POSTINC0                      1490
#define INDF0                         1491
#define INTCON3                       1492
#define INT1IF                        1493
#define INT1F                         1494
#define INT2IF                        1495
#define INT2F                         1496
#define INT1E                         1497
#define INT1IE                        1498
#define INT2IE                        1499
#define INT2E                         1500
#define INT1P                         1501
#define INT1IP                        1502
#define INT2IP                        1503
#define INT2P                         1504
#define INTCON2                       1505
#define RBIP                          1506
#define TMR0IP                        1507
#define INTEDG2                       1508
#define INTEDG1                       1509
#define INTEDG0                       1510
#define RBPU                          1511
#define NOT_RBPU                      1512
#define nRBPU                         1513
#define INTCON                        1514
#define RBIF                          1515
#define INT0F                         1516
#define INT0IF                        1517
#define T0IF                          1518
#define TMR0IF                        1519
#define RBIE                          1520
#define INT0E                         1521
#define INT0IE                        1522
#define T0IE                          1523
#define TMR0IE                        1524
#define PEIE                          1525
#define PEIE_GIEL                     1526
#define GIEL                          1527
#define GIE_GIEH                      1528
#define GIE                           1529
#define GIEH                          1530
#define PRODL                         1531
#define PRODH                         1532
#define TABLAT                        1533
#define TBLPTRL                       1534
#define TBLPTRH                       1535
#define TBLPTRU                       1536
#define ACSS                          1537
#define PCL                           1538
#define PCLATH                        1539
#define PCH                           1540
#define STKPTR0                       1541
#define STKPTR                        1542
#define SP0                           1543
#define STKPTR1                       1544
#define SP1                           1545
#define STKPTR2                       1546
#define SP2                           1547
#define SP3                           1548
#define STKPTR3                       1549
#define STKPTR4                       1550
#define SP4                           1551
#define STKUNF                        1552
#define STKOVF                        1553
#define STKFUL                        1554
#define TOSL                          1555
#define TOSH                          1556

#endif // _PIC18LF23K22_H_
